Revit 2026 API

# Asset Properties

---

The Asset type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AssetType | The type of RenderingAsset |
|  | IsReadOnly | Identifies if the object is read-only or modifiable. If true, the object may not be modified. If false, the object's contents may be modified. (Inherited from AssetProperty) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from AssetProperty) |
|  | Item | (Inherited from AssetProperties) |
|  | LibraryName | Library name |
|  | Name | Get the name of the AssetProperty(Inherited from AssetProperty) |
|  | NumberOfConnectedProperties | The number of currently connected properties. (Inherited from AssetProperty) |
|  | Size | The number of the AssetProperty(s) in the object. (Inherited from AssetProperties) |
|  | Title | Asset title |
|  | Type | Returns the type of the AssetProperty(Inherited from AssetProperty) |

#### Reference

Asset Class

Autodesk.Revit.DB.Visual Namespace